In [90]:
import pandas as pd
import numpy as np
data = pd.read_csv('titanic.csv',index_col='PassengerId')

In [91]:
data.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35,0,0,373450,8.0500,NaN,S

In [92]:
data.drop(data.columns[[2,5,6,7,9,10]], axis=1, inplace=True)

In [93]:
data.head()

             Survived  Pclass     Sex  Age     Fare
PassengerId
1                   0       3    male   22   7.2500
2                   1       1  female   38  71.2833
3                   1       3  female   26   7.9250
4                   1       1  female   35  53.1000
5                   0       3    male   35   8.0500

In [94]:
ch = np.isnan(data['Survived'])
ch.value_counts()

False    891
Name: Survived, dtype: int64

In [95]:
ch = np.isnan(data['Pclass'])
ch.value_counts()

False    891
Name: Pclass, dtype: int64

In [96]:
ch = np.isnan(data['Age'])
ch.value_counts()

False    714
True     177
Name: Age, dtype: int64

In [97]:
ch = np.isnan(data['Fare'])
ch.value_counts()

False    891
Name: Fare, dtype: int64

In [98]:
data['Sex'].value_counts()

male      577
female    314
Name: Sex, dtype: int64

In [99]:
cl_data = data.dropna(axis=0)

In [101]:
surv_data = cl_data['Survived']

In [103]:
cl_data = cl_data.drop('Survived',1)

In [104]:
cl_data.head()

             Pclass     Sex  Age     Fare
PassengerId
1                 3    male   22   7.2500
2                 1  female   38  71.2833
3                 3  female   26   7.9250
4                 1  female   35  53.1000
5                 3    male   35   8.0500

In [118]:
cl_data['Sex'] = cl_data['Sex'].str.replace('male','1')
cl_data['Sex'] = cl_data['Sex'].str.replace('fe1','0')
cl_data['Sex'] = cl_data['Sex'].astype(int)
cl_data.head()

             Pclass  Sex  Age     Fare
PassengerId
1                 3    1   22   7.2500
2                 1    0   38  71.2833
3                 3    0   26   7.9250
4                 1    0   35  53.1000
5                 3    1   35   8.0500

In [119]:
from sklearn.tree import DecisionTreeClassifier

In [120]:
X = np.array(cl_data)
y = np.array(surv_data)

In [121]:
clf = DecisionTreeClassifier(random_state=241)

In [122]:
clf.fit(X,y)

DecisionTreeClassifier(class_weight=None, criterion='gini', max_depth=None,
            max_features=None, max_leaf_nodes=None, min_samples_leaf=1,
            min_samples_split=2, min_weight_fraction_leaf=0.0,
            presort=False, random_state=241, splitter='best')

In [123]:
importance = clf.feature_importances_

In [124]:
X

array([[  3.    ,   1.    ,  22.    ,   7.25  ],
       [  1.    ,   0.    ,  38.    ,  71.2833],
       [  3.    ,   0.    ,  26.    ,   7.925 ],
       ...,
       [  1.    ,   0.    ,  19.    ,  30.    ],
       [  1.    ,   1.    ,  26.    ,  30.    ],
       [  3.    ,   1.    ,  32.    ,   7.75  ]])

In [126]:
importance

array([ 0.14000522,  0.30051221,  0.2560461 ,  0.30343647])